{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "1", "default_text": "the frequency of solar storms with impact on electric circuits on earth", "description": "\n      How often do solar storms occur which have a noticeable impact on electric circuits on earth?\n    ", "narrative": "\n      Scientific publications or articles which describe how often solar storms occur (or how likely it is that such a storm occurs), which have an impact on our modern civilization in the form of damaging or destroying electrical circuits such as power supply or communication infrastructure. Especially sources which say how often these occurred in the past should be retrieved as relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "2", "default_text": "popular pastries in germany", "description": "\n      Which are the best-selling pastries in Germany?\n    ", "narrative": "\n      Find statistics, news articles or other information about the most popular sweet bakery products in Germany. The sources should contain specific information about the best-selling bakery products in Germany. It could contain information about specific products or categories of products.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "3", "default_text": "flights Frankfurt to Rome", "description": "\n      Show flight connections from Frankfurt to Rome.\n    ", "narrative": "\n      Relevant are all future flight connections from Frankfurt to Rome. We are not (yet) interested in connections in the opposite direction, nor flights from or to other cities or how to make the journey by other means of transport.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "4", "default_text": "remove wine stains", "description": "\n      How can wine stains be removed?\n    ", "narrative": "\n      Relevant is all information about wine stain removal. The removal of other substances is not of interest. Nor do we want to acquire wine bottles from a shop.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "5", "default_text": "tipping in us", "description": "\n      What tipping is considered appropriate for whom in the US?\n    ", "narrative": "\n      We ask for some guidelines of how to correctly tip in the US. The results should be of recent nature in order to account for inflation. The term \"us\" should be recognized as an acronym for the United States. How to tip in other countries is not of interest.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "6", "default_text": "download python", "description": "\n      Direct me to pages from which python can be downloaded.\n    ", "narrative": "\n      Relevant are trustworthy pages from which python can be downloaded. Results that misinterpret python as an animal as well as resources that provide information about how to download other programs are not of interest.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "7", "default_text": "buy bicycle lock Jena", "description": "\n      Where can a bicycle lock be bought in Jena?\n    ", "narrative": "\n      Relevant results indicate shops in Jena that offer bicycle locks. Shops outside of Jena or shops that offer either bicycles or general locks but not locks for bicycles are not of interest.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "8", "default_text": "Current head of state of germany", "description": "\n      Who is the current head of state of Germany?\n    ", "narrative": "\n      Relevant results include information about the head of state of Germany and the time frame of them being head of state. Sources which only include heads of state of Germany without information about when they were head of state or sources which include only heads of state of other countries are not relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "9", "default_text": "fastest route jena leipzig", "description": "\n      Which is the fastest means of transport from Jena to Leipzig right now and which route should I take?\n    ", "narrative": "\n      Look for the fastest connection in public transport between Jena and Leipzig at the time and calculate the time it would take when using a car from and to each city centre. Display the route which takes the least time. Do not display routes from Leipzig to Jena and do not show train connections that already departed.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "10", "default_text": "lost my keys what now", "description": "\n      What can be done if you lose your apartment keys?\n    ", "narrative": "\n      Relevant is all information on how to get your keys back or on how to get back into your apartment. It could contain certain addresses for places where lost things are returned to, detailed instructions on how to get into the apartment yourself without keys or provide contact details for locksmiths.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "11", "default_text": "an apple everyday healthy?", "description": "\n      What effects does eating an apple everyday have on the health of human body?\n    ", "narrative": "\n      Show scientific publications and health expert opinions on the effects of eating apples everyday. They should include information about the potential health benefits and risks of doing so. It could also cover the nutritional values of apples.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "12", "default_text": "what temperature for green tea", "description": "\n      What is the optimal temperature for the water for green tea preparation?\n    ", "narrative": "\n      Find resources which explain which temperature the water should have to prepare green tea. Ressources which only give general information about the green tea preparation without stating an optimal temperature are not relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "13", "default_text": "probability of snow in december in jena", "description": "\n      How high is the probability that there will be snow at least once in December in Jena?\n    ", "narrative": "\n      Find publications about the weather in jena in the winter. Of interest are statistic based articles or publications which give a concrete probability of there being snow at least once in December in Jena, based on the weather in the previous years.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "14", "default_text": "how to screenshot windows", "description": "\n      Which hotkey or combination of buttons do I have to press to take a screenshot on the Windows OS?\n    ", "narrative": "\n      Relevant are manuals, guides and forum entries on the matter that indicate how to take a screenshot. Not relevant are information about glass windows or information concerning other operating systems.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "15", "default_text": "what is my ip address", "description": "\n      What is the current IPv4 address of the device that I am using?\n    ", "narrative": "\n      Either show the user its IP address directly as a search result or display relevant documents and manuals on how to determine ones IPv4 address. Should not display other IP addresses that do not belong to the user or the address of his current location.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "16", "default_text": "how to exit vim", "description": "\n      what keyboard shortcut needs to be pressed in order to exit the text editor vim\n    ", "narrative": "\n      Relevant topics include documentation about the text editor vim or blog posts from web forums. Topics that focus on different aspects of vim or comparisons of terminal-based text editors are not relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "17", "default_text": "martin garrix animals bpm", "description": "\n      The user wants to know the tempo, or beats-per-minute, of the sound-track Animals by artist Martin Garrix\n    ", "narrative": "\n      Relevant topics include music databases and blog posts from web forums. Topics including reaction content or any kind of media are not relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "18", "default_text": "upcoming movies 2023", "description": "\n      which movies will be released in cinemas or on streaming websites in 2023\n    ", "narrative": "\n      Relevant topics include any news website focused on movies or cinema and top-ten lists of movies in 2023. Topics that focus on films released in previous years or in future or reviews of movies are less relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "19", "default_text": "science fiction books", "description": "\n      The user wants to find a selection of science fiction books.\n    ", "narrative": "\n      Relevant topics include bookstores or collections of free books. Topics that focus on anything else than science fiction or any books that do not feature any elements known for science fiction are less relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "20", "default_text": "wikipedia timo boll", "description": "\n      The user wants to get the link to the Wikipedia page of table tennis player Timo Boll.\n    ", "narrative": "\n      Relevant topics include anything related to the life of Timo Boll or any Wikipedia pages of people associated with Timo Boll. Topics that have nothing to do with either table tennis or Timo Boll or simple pictures of Time Boll are not relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "21", "default_text": "Knowledge Graphs in Information Retrieval", "description": "\n      The user is looking for information about the use of knowledge graphs in information retrieval, including their applications, advantages, and how they enhance search and recommendation systems.\n    ", "narrative": "\n      Relevant topics include research papers on knowledge graph-based information retrieval, articles from tech companies employing knowledge graphs, and case studies on their implementation. Topics discussing graph databases, semantic web technologies, and real-world examples of how knowledge graphs improve search and recommendation systems are considered relevant. However, topics unrelated to knowledge graphs in information retrieval or those discussing other graph-related concepts are not relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "22", "default_text": "DuckDuckGo Search Engine", "description": "\n      The user is interested in learning about the DuckDuckGo search engine, including its features, privacy policies, and how it differs from other search engines like Google.\n    ", "narrative": "\n      Relevant topics include articles about DuckDuckGo's privacy-centric approach to search, its search features, and user reviews. Sources discussing DuckDuckGo's business model, comparisons with other search engines, and its commitment to user data privacy are considered relevant. However, topics unrelated to DuckDuckGo or those promoting other search engines are not relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "23", "default_text": "Friedrich Schiller University of Jena (FSU Jena)", "description": "\n      The user is seeking information about the Friedrich Schiller University of Jena (FSU Jena), including its history, notable programs, and notable alumni.\n    ", "narrative": "\n      Relevant topics include the official website of FSU Jena, academic programs and research areas offered by the university, and profiles of notable alumni. Sources that provide insights into the university's history, achievements, and its role in the academic world are considered relevant. However, topics unrelated to FSU Jena or sources promoting other institutions are not relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "24", "default_text": "System Accreditation in Education", "description": "\n      The user is interested in understanding the concept of system accreditation in the field of education, including its purpose, process, and significance for educational institutions.\n    ", "narrative": "\n      Relevant topics include articles explaining the system accreditation process, the role of accrediting bodies, and how it ensures educational quality. Sources discussing the benefits of accreditation for institutions and students, and the impact on academic standards are considered relevant. However, topics unrelated to system accreditation in education or those discussing accreditation in non-educational contexts are not relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "25", "default_text": "Biodiversity Conservation and Importance", "description": "\n      The user is interested in understanding the importance of biodiversity conservation and its impact on ecosystems and human well-being.\n    ", "narrative": "\n      Relevant topics include scientific studies on biodiversity, articles from environmental organizations, and reports from conservation agencies. Sources discussing threats to biodiversity, strategies for conservation, and the benefits of biodiversity to ecosystems and human societies are considered relevant. However, topics that downplay the significance of biodiversity or promote activities harmful to it are not relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "26", "default_text": "Top smartphone reviews 2023", "description": "\n      The user is looking for detailed and reliable reviews of the best smartphones released in 2023. They are interested in expert opinions and comparisons.\n    ", "narrative": "\n      Relevant: Smartphone reviews, comparisons, ratings, and recommendations for 2023. Not Relevant: Information about older smartphones or unrelated products.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "27", "default_text": "Taylor Swift concert New York tickets", "description": "\n      The user wants to purchase tickets for an upcoming Taylor Swift concert in New York.\n    ", "narrative": "\n      Relevant: Ticket purchasing options, prices, seating, and availability for the specified concert. Not Relevant: Information about other artists or events in different locations.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "28", "default_text": "Online piano lessons for beginners", "description": "\n      The user is interested in finding online resources or courses to learn how to play the piano as a beginner.\n    ", "narrative": "\n      Relevant: Online piano lessons, tutorials, courses, and beginner-friendly resources. Not Relevant: Advanced piano techniques, offline classes, or unrelated instruments.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "29", "default_text": "Japan passport application government site", "description": "\n      The user wants to access the official government website for the Japanese passport application process.\n    ", "narrative": "\n      Relevant: The official Japanese government website for passport applications, application forms, instructions, and contact information. Not Relevant: Third-party websites, passport tracking, or unrelated government services.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "30", "default_text": "Climate change causes and effects", "description": "\n      The user is looking for comprehensive information on the causes and effects of climate change, potentially for research or educational purposes.\n    ", "narrative": "\n      Relevant: Scientific data, research findings, articles, and reports on the causes and consequences of climate change. Not Relevant: Climate change denial, unrelated environmental topics, or news unrelated to the science of climate change.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "31", "default_text": "Home Assistant unavailable", "description": "\n      The user wants to determine why his Home Assistant instance is unavailable and what can be done to make it available again?\n    ", "narrative": "\n      Search results include debugging advice for figuring out why a Home Assistant instance is unavailable and which actions can be taken to resolve this issue. General advice on networking, servers and potential root causes for unavailability. Local network management, firewall rules and port forwarding also play an important role in this context.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "32", "default_text": "ESPHome disable IPv6", "description": "\n      How can IPv6 be disabled on ESPHome-based devices?\n    ", "narrative": "\n      Relevant sources include documentation related to ESPHome, more specifically networking and connection-related components. Additional general advice on how to configure ESPHome devices can be beneficial.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "33", "default_text": "aadl tools", "description": "\n      Which tools are available for the Architecture Analysis and Design Language?\n    ", "narrative": "\n      Relevant sources include information about the Architecture Analysis and Design language(AADL) and tools that can  be used to work with AADL. Not relevant are resources which also use the acronym AADL but do not refer to the Architecture analysis and Design language.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "34", "default_text": "3D print warping", "description": "\n      What is warping in the context of 3D printing and how can it be avoided?\n    ", "narrative": "\n      Explanation of 3d printing and reasons for warping parts. Explanations of possible solutions for avoiding warping or Elephants foot. Details on contracting plastic during the extrusion process.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "35", "default_text": "OpenGL setup", "description": "\n      The user is interested in a Guide on how to set up an OpenGL development environment.\n    ", "narrative": "\n      General information about OpenGL and System requirements. Results should also include resources on how OpenGL development environments can be set up. They should not be Operating-System-dependent.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "36", "default_text": "fontawesome angular", "description": "\n      What is the best way to use Fontawesome icons in Angular?\n    ", "narrative": "\n      Relevant documents must include how to use Fontawesome icons in Angular. It is important what libraries need to be included and how to display icons on a page in general. Not relevant are the specific icons or articles that are not applicable to Angular. Specifically, Angular icons are irrelevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "37", "default_text": "flat roof cons", "description": "\n      What are disadvantages of using a flat roof for buildings?\n    ", "narrative": "\n      Relevant documents must address what disadvantages flat roofs on buildings entail. Advantages are not relevant in the first place. Likewise, general information is not of interest unless it contains obvious disadvantages or is necessary to understand the disadvantages of flat roofs on buildings.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "38", "default_text": "raspberry pi power consumption", "description": "\n      How many watts does a current Raspberry Pi consume on average?\n    ", "narrative": "\n      Relevant documents must contain information about the energy consumption of a current Raspberry Pi. It does not matter which generation or which specific model is involved. However, documents that are about the Raspberry Pi microcontrollers or accessory items are not relevant. Also not relevant are documents that are only about power (consumption) or only about the Raspberry Pi in general.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "39", "default_text": "light motion detector types", "description": "\n      What options for motion detectors are currently installed in motion sensor lamps and how do they work?\n    ", "narrative": "\n      Relevant documents deal with various motion detection sensors that are built into lamps, as well as related technologies and features. Irrelevant are purchase options for these lamps, as well as motion detection sensors that are not built into lamps or lamps without motion sensors. Furthermore, specific models of lamps with motion sensors are also uninteresting. Above all, \"lightweight\" motion sensors or lamps are also not relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "40", "default_text": "czk to eur", "description": "\n      What is the latest exchange rate from Czech Crowns to Euros?\n    ", "narrative": "\n      Relevant documents must include the most current exchange rate from Czech Crowns to Euros. General or historical information is irrelevant. The exchange rate from Euros to Crowns is also not relevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "41", "default_text": "pumpkin soup", "description": "\n      What are recipes for a pumpkin soup?\n    ", "narrative": "\n      Relevant documents include recipes for soups that use pumpkin as an ingredient. The most relevant recipes would use pumpkin as the main ingredient. Recipes that are not a soup or do not include pumpkin as an ingredient are not relevant. Reports about pumpkin soup, like restaurant recommendations, are also irrelevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "42", "default_text": "turn off pocket mode", "description": "\n      How do I turn off the pocket mode on my smartphone?\n    ", "narrative": "\n      Relevant documents include directions on how to find the pocket mode slider in the settings app of a smartphone.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "43", "default_text": "potpourri", "description": "\n      What is a potpourri?\n    ", "narrative": "\n      Relevant documents include definitions of potpourri. Websites that sell potpourris are not relevant for this topic.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "44", "default_text": "state election hessen 2023", "description": "\n      What are the results of the state election in Hessen in 2023?\n    ", "narrative": "\n      Relevant documents include each party's share of votes, their development in comparison to the last election and other related statistics like the share of votes for young and old people. Documents that include this information for an older election are irrelevant. Documents older than the election are also irrelevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "45", "default_text": "turtle species list", "description": "\n      What are some turtle species?\n    ", "narrative": "\n      Relevant documents include lists of turtle species with names. Documents with lists of other species are irrelevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "46", "default_text": "time change germany", "description": "\n      When is the next time change in Germany?\n    ", "narrative": "\n      Relevant topics are short articles describing the next time change date and exact time change. Time change in other contries or past time changes are irrelevant. Discussions about the time changes are also irrelevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "47", "default_text": "water daily need", "description": "\n      How much Water should an adult person drink daily?\n    ", "narrative": "\n      Relevant topics describe how much water a person needs and on what circumstances it depends. The discussion should focus on a normal adult with a normal daily routine in normal weather. Extrem weather, sports or work are irrelevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "48", "default_text": "canteen jena", "description": "\n      What food is offered today in the main canteen in Jena?\n    ", "narrative": "\n      Relevant topics describe the meal in the Ernst Abbe canteen in Jena for today. Irrelevant are past meals or other canteens. For the different foods there should be a list with important ingredients and allergens.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "49", "default_text": "penspinning", "description": "\n      What tricks exist in penspinning?\n    ", "narrative": "\n      Relevant topics describe tricks with a pen from easy tricks to hard. Tricks what need other materials or are too hard are irrelevant. The article should describe the tricks and how to learn them.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "50", "default_text": "stairs Jentower", "description": "\n      How many stairs does the Jentower in Jena have?\n    ", "narrative": "\n      Relevant topics describe how many stairs the Jentower in Jena has. Other towers and other cities are irrelevant. Information like opening hours, events or about other things are irrelevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "51", "default_text": "meditation for stress", "description": "\n      How can mindfulness meditation alleviates stress and anxiety?\n    ", "narrative": "\n        Relevant documents should provide insights into how mindfulness meditation is integrated into everyday life to effectively reduce stress, including practical information on small daily exercises and techniques. Irrelevant documents include unrelated forms of therapy or  general meditation techniques lacking the application of mindfulness meditation specific for stress. Furthermore, sources merely selling courses or presenting some meditation gurus are considered irrelevant as well.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "52", "default_text": "trend of ocean pollution", "description": "\n      How is plastic pollution in the oceans has developed through the years and what is it expected to look like?\n    ", "narrative": "\n      Relevant documents include information about how plastic in oceans has increased in the last years based on graphs and data, together with some prognostic for the future. If data are collected only up to a certain year or are not up-to-date anymore, then the document is considered irrelevant. Also irrelevant are sources containing information about how plastic can be avoided in everyday life or selling eco-friendly products.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "53", "default_text": "balanced vegan diet", "description": "\n      What are some key nutrients and recipes for a balanced vegan diet?\n    ", "narrative": "\n        Relevant sources offer insights into essential nutrients to integrate into recipes for vegans, such as protein sources, iron, vitamin B12, and calcium, along with strategies for a balanced vegan lifestyle. Irrelevant documents include materials that focus on unrelated dietary practices or lack practical information, for examples if they just expose some health advantages associated with a vegan diet without comprehensive practical guidance on adopting and sustaining a vegan lifestyle.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "54", "default_text": "business informatics jobs asti", "description": "\n      What job opportunities are available for Business Informatics graduates in Asti (Italy)?\n    ", "narrative": "\n      Relevant documents provide information on the current job opportunities and career prospects for graduates with a degree in Business Informatics in the city of Asti in Italy, with details on the tasks of the roles, salaries, working times, and companies hiring individuals with this qualification. Irrelevant documents do not contain information about the role, working time, salary, or the hiring company. Additionally, sources promoting job positions unrelated to the field of Business Informatics or not specific to the Asti region should be considered irrelevant.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/jena-topics-20231026-test", "qid": "55", "default_text": "decorate small spaces on a budget ", "description": "\n      What are some creative and budget-friendly interior decorating ideas for a house with small spaces?\n    ", "narrative": "\n      Relevant documents should provide a variety of creative and budget-friendly house decorating ideas with pictures, tailored to small spaces, including tips on maximizing storage, optimizing furniture arrangement, and choosing color schemes to enhance the perception of space. Additionally, relevant materials should offer insights into DIY projects, repurposing techniques, and cost-effective decor solutions. Irrelevant documents encompass house decorating ideas unrelated to interior decoration, such as gardening, or unrelated to residential properties, like office spaces, as well as those lacking budget-friendly solutions and only promoting high-cost or luxury decor options.\n    "}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "1", "default_text": "develop film at home", "description": "what is the mechanical and chemical process of developing analog film at home?", "narrative": "relevant documents should provide instructions on how to develop analog film in a non-professional manner. they should cover essential equipment and chemicals required, along with information on where to purchase them. a detailed, step-by-step tutorial is expected. additionally, the documents could also discuss any challenges encountered during the development process and provide insights into the current state of the film community"}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "2", "default_text": "wildfire prevention", "description": "what are the various techniques and strategies available to mitigate the occurrence and spread of wildfires?", "narrative": "relevant documents will illustrate methods for preventing wildfires or curbing their propagation."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "3", "default_text": "drone legislation", "description": "in which manner is a person allowed to fly a drone over public property?", "narrative": "relevant documents should address in which range a private person is allowed to fly a drone over public property and also take recordings. if there is a permission needed the document should mention where to acquire such document."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "4", "default_text": "artificial intelligence applications", "description": "what are the practical use cases of artificial intelligence?", "narrative": "relevant documents address practical applications and use cases of artificial intelligence in different industries and fields. they should also discuss the benefits and challenges that come with the use of artificial intelligence."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "5", "default_text": "remove red wine couch", "description": "what methods or solutions are recommended to effectively remove red wine from a couch?", "narrative": "relevant sources include guides, articles, and videos that offer detailed methods or solutions for removing red wine from a couch. this can cover various techniques, home remedies, or commercial products specifically designed for the task. sources that provide only superficial advice, do not specifically address red wine, or do not focus on couches or similar fabrics are not considered relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "6", "default_text": "spoken language in india", "description": "which sources dive into the spoken languages and dialects spoken in india?", "narrative": "relevant sources include research papers, articles, or other materials that provide in-depth information about the spoken languages and dialects of india. this can encompass the history, variations, and significance of the indian language, as well as regional dialects or minority languages spoken in the country. sources that only briefly mention the indian language without detailed exploration or those that focus on written forms without considering spoken nuances are not deemed relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "7", "default_text": "islands in japan", "description": "which sources provide detailed information about islands in japan?", "narrative": "relevant sources include research papers, articles, or any other material that discusses and gives detailed information about the islands in japan. these may focus on their geography, culture, history, or significance. sources that merely mention islands in a broader context without in-depth details specific to japan's islands are not considered relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "8", "default_text": "best restaurants new york", "description": "which are the best restaurants in new york city right now?", "narrative": "relevant sources include rankings of restaurants and websites of awarded restaurants. these sources should include information that is quite new and the restaurants should still be open. actuality is key as during covid many restaurants did close. the sources should not include restaurants that are not in new york city and also should not include cafés, supermarkets or street markets."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "9", "default_text": "vegan alternatives to common dairy products", "description": "what sources provide information on vegan substitutes for traditional dairy products in cooking and baking?", "narrative": "relevant sources should discuss vegan alternatives for items like milk, cheese, butter, and cream. articles merely highlighting veganism without a focus on dairy substitutes are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "10", "default_text": "autonomous cars in real traffic conditions", "description": "how do self-driving cars work, how do they adapt and respond to real driving situations, and what are the biggest challenges and advances in this context?", "narrative": "relevant sources should discuss the behavior, adaptability and decision-making processes of autonomous vehicles in dealing with various driving situations, from congested city streets to high-speed highways. the focus should be on actual experiences, tests and observations. general assessments of autonomous technology without direct reference to real-world driving conditions are irrelevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "11", "default_text": "origins and spread of the silk road trade routes", "description": "what documents provide information about the origins of the silk road trade routes and how they fostered cultural exchange and economic interactions between civilizations?", "narrative": "relevant papers include historical descriptions on the establishment, expansion, and impact of the silk road trade routes on the exchange of goods, ideas, and cultures between asia, the middle east, and europe. papers focusing on other trade routes or unrelated historical trade networks are not relevant. likewise articles about the modern \"belt and road initiative\" are not the center of interest."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "12", "default_text": "recommended daily step count for optimal health", "description": "what is the recommended number of daily steps for achieving and maintaining optimal health?", "narrative": "relevant information should focus on scientific research and guidelines pertaining to the ideal daily step count for achieving or improving one's health. papers discussing other aspects of physical activity or general health-related topics are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "13", "default_text": "recognize phishing attack", "description": "what documents focus on approaches to recognize a phishing attack?", "narrative": "relevant documents include possible approaches to identify phishing or describe different phishing types. documents that suggest ways to protect from phishing are also relevant. documents that focus on other attacks are not relevant. anything about fishing is not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "14", "default_text": "evolution of the alphabet", "description": "what documents explore the historical development and evolution of the alphabet system?", "narrative": "relevant documents should discuss the history and origins of written alphabets and their respective letters. documents focusing on the biological concept of evolution, the company alphabet or other unrelated topics should not be considered relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "15", "default_text": "dropshipping", "description": "what document or page describes/offer solutions for the business model dropshipping", "narrative": "relevant documents and pages include descriptions and general information about the business model dropshipping or offer solutions that can help creating an own dropshipping business. not relevant are documents or pages that focus on shipping goods, ships in general or e-commerce stores (webshops)."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "16", "default_text": "install linux on windows machine", "description": "what documents/pages focus on the process of installing a linux system on a machine running windows.", "narrative": "relevant documents focus on the installation of linux. specifically on a machine currently running a windows operating system. instructions how to accomplish the task as well as documents describing challenges are relevant. documents about installing linux on a machine not running windows is not relevant. neither are documents describing installation of windows on any machine."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "17", "default_text": "improving image quality using generative adversarial networks", "description": "what documents discuss the improvement of image quality using generative adversarial networks?", "narrative": "relevant documents include research on improving image quality by using generative adversarial networks. documents that focus on other ways of improving image quality or talk about generating original images or perform other tasks using generative adversarial networks are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "18", "default_text": "hate speech detection", "description": "what papers focus on hate speech detection?", "narrative": "relevant papers include research on what makes speech hate speech and on how to detect it. paper that focus on detecting something else are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "19", "default_text": "entity recognition for managing great amounts of data", "description": "how can entity recognition be used to help manage great amounts of data?", "narrative": "relevant results include analysises, examples, implementations or otherwise informative papers on the handling of data using named entity recognition. results that discuss general named entity recognition and its usecases, not regarding the handling of data, or results discussing any topics regarding data management without named entity recognition are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "20", "default_text": "fine-tuning large language models", "description": "which methods can be used to fine-tune a large language model to a specific use case?", "narrative": "relevant documents contain general approaches for fine-tuning large-scale models. in addition, the underlying technologies may be part of these documents. the documents provide step-by-step guidance for fine-tuning a model for your use case. documents explaining the process of pre-tuning large language models are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "21", "default_text": "reduce risk cardiovascular disease", "description": "what are methods, habits or lifestyle decisions that will reduce the risk of a cardiovascular disease?", "narrative": "relevant documents present actions individuals can undertake to reduce their risk of cardiovascular diseases (e.g., stroke, heart failure). the documents include scientific evidence of these actions and explain why they are beneficial for one's heart condition. documents that focus on the risk reduction of other diseases or those offering only introductory explanations of cardiovascular diseases are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "22", "default_text": "risks and benefits of nuclear energy", "description": "what are risks and benefits of using nuclear energy solutions?", "narrative": "relevant documents list risks and benefits of using nuclear energy in our electrical grid. documents may include the usage of nuclear energy in different environments and for different goals like usage in submarines. documents explaining how nuclear power plants work without detailing risks and benefits and documents explaining what nuclear energy is are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "23", "default_text": "impact social media", "description": "what are the effects of social media on society, encompassing communication, relationships, information dissemination, and mental health?", "narrative": "relevant documents should cover the spectrum of the impact of social media on various aspects of society, such as communication, relationships, information sharing, mental health. these documents should provide insights into the positive and negative effects, trends, and studies related to the topic. the focus should be on the societal impact of social media. documents discussing individual platforms, data analytics and market research or other unrelated topics are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "24", "default_text": "how to fix broken windows", "description": "information on how to fix broken glass windows", "narrative": "relevant results include tips for repairing broken glass or pvc windows. other components which could be broken and need repair are also included. also included are repair services. results containing information about glass windows like, for example, the windows os are irrelevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "25", "default_text": "technical university of munich", "description": "what information is available about the technical university of munich?", "narrative": "relevant results include information about people connected to the technical university of munich and information about the university itself, e.g. its history, publications, events, study options or its ranking. results which do not contain information about the technical university of munich are irrelevant, e.g. information about other institutions in munich, other universities or about the city of munich."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "26", "default_text": "concerns for artificial intelligence in healthcare", "description": "what information is available about concerns related to the use of artificial intelligence in healthcare?", "narrative": "relevant results focus on ethical, technical, or social concerns regarding ai applications within healthcare. results that discuss general ai concerns not specific to healthcare or concerns about healthcare without the ai aspect are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "27", "default_text": "good practice software testing", "description": "what are good practices in testing software?", "narrative": "relevant results give information on how to test software. results that are not about testing are irrelevant. results which do not show how to test software are not relevant. good results focus on software testing in general and not on specific software."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "28", "default_text": "cat fur care", "description": "what can one do to better take care of the fur of a cat?", "narrative": "relevant answers include steps to improve the fur of a cat and how often one should do this. answers that focus on other aspects of a cat's life, like food or social life, are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "29", "default_text": "wind turbine power generation", "description": "how much power do different kinds of wind turbines produce?", "narrative": "relevant documents about wind turbine power generation should contain a comparison of different kinds of wind turbines and their power output. the information could be presented in a table or graph. a history and outlook in the future of wind turbine power generation would also be useful. information about other kinds of power generation are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "30", "default_text": "privacy protection strategies on social media", "description": "what papers and articles focus on strategies to protect personal privacy on social media?", "narrative": "relevant papers and articles address data privacy on social media and explore or recommend strategies for securing personal data on social media. papers and articles that are not in the context of social media and data privacy or do not provide strategies to protect personal data on social media, are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "31", "default_text": "artificial intelligence in healthcare", "description": "what research papers focus on artificial intelligence in healthcare?", "narrative": "relevant documents need to contain information about artificial intelligence in the healthcare sector. this can be information about artificial intelligence that is already being applied or about concepts that could be implemented in the future. papers that only address artificial intelligence or healthcare by itself should not be included in the search results."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "32", "default_text": "super mario cosmic ray bit flip", "description": "which articles or other results discuss the event, in which a cosmic ray bit flip aided a super mario 64 speedrunner?", "narrative": "results which describe, explain, or mention the event in which a cosmic ray bit flip aided a super mario 64 speedrunner are relevant. results which do not discuss any of the two topics, or only one of them are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "33", "default_text": "current inflation explanation", "description": "what documents focus on an explanation for the current inflation?", "narrative": "relevant papers include an explanation and reasons for the current ongoing money inflation in many countries. papers that only focus on previous inflations or not giving any explanation are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "34", "default_text": "techno music history", "description": "history of techno music", "narrative": "relevant documents will provide information on the history of techno music. emphasis will be placed on origins, development, key players and instruments. information about individual subjects and objects that are not relevant to the general history of techno music or such about electronic music in general is not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "35", "default_text": "cycling race rules", "description": "rules for cycling races", "narrative": "relevant documents include official rules for cycling races. relevant documents include, for example, the rules for various cycling disciplines such as road cycling, mountain biking or others. rules for races not contested on a bicycle are not relevant. rules for other sports are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "36", "default_text": "disc brake repair", "description": "how to repair or replace disc brakes on bicycles", "narrative": "relevant documents must include details of how disc brakes on bicycles can be repaired or replaced. relevant details include information about how to remove, attach, or maintain disc brake parts, investigate and resolve issues with disc breaks, and how to acquire replacement parts."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "37", "default_text": "marathon training plan intermediate", "description": "how to train for a marathon as an intermediate runner?", "narrative": "relevant documents include training plans for intermediate runners that want to train for a marathon. documents that focus on beginners or advanced runners or distances other than a marathon are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "38", "default_text": "image recognition automobile", "description": "what papers focus on image recognition algorithms and techniques used in automobiles?", "narrative": "relevant papers include research on computer vision techniques for driver assistance systems. papers that focus on image recognition in other areas or on algorithms for the recognition of automobiles and other vehicles in images from external sources, including training sets for such use, are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "39", "default_text": "generative adversarial machine translation", "description": "what papers focus on applying the generative adversarial network paradigm on machine translation?", "narrative": "relevant papers include research on generative adversarial networks applied to machine translation. papers that focus on applying generative adversarial networks on something else than machine translation or performing machine translation using only other paradigms are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "40", "default_text": "impact of social media on mental health", "description": "provide research papers that assess the influence of social media usage on mental health.", "narrative": "relevant papers should examine the relationship between the use of social media and its effects on mental health. papers discussing other aspects of social media or unrelated mental health issues are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "41", "default_text": "foundations of chemical engineering", "description": "all papers, books or articles concerning different aspects of chemical engineering.", "narrative": "results pertaining to regular engineering, different aspects of chemistry or building foundations are irrelevant to the query. to be considered useful for this information need retrieved documents contain material on any direct part of the subject chemical engineering or on chemical engineering as a whole."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "42", "default_text": "methods for protein structure analysis", "description": "which methods are there to analyse protein structures and how do they work/perform?", "narrative": "relevant entries elaborate upon one or more methods that are used to obtain the unknown structure of a protein. for example x-ray crystallography, nmr spectroscopy, cryoem or computational methods. the entry should not contain a general discussion about the structure of a certain protein and / or it's domains and / or their function. if such a discussion is provided in an entry that also elaborates upon the used method to obtain the structure it is valid."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "43", "default_text": "ai ethical downsides", "description": "what are ethical problems and concerns in the field of artificial intelligence?", "narrative": "relevant documents discuss, comment on or point out negative impacts that artificial intelligence can have on our society and what must be taken into account by developers or users to avoid harmful outcomes. content that only focusses on the benefits of ai are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "44", "default_text": "using cnns for image data", "description": "which entries describe why convolutional neural networks are useful for image data?", "narrative": "relevant entries describe why cnns are commonly used while analyzing image data. entries that focus on describing neural networks or other similar architectures are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "45", "default_text": "social media bot influence", "description": "why do bot accounts on social media exist and how are they influential?", "narrative": "relevant articles explain what bots in social media that mimic user accounts are (fake accounts), how prominent they are, why they are created and how they can be influential. not relevant are articles about bots that declare they are bots and that are created to fulfill tasks like detecting reposted content."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "46", "default_text": "machine learning in energy system analysis", "description": "what publications explore the use of machine learning algorithms to improve the modeling and analysis of energy systems?", "narrative": "relevant papers include research on new approaches to energy system modeling and analysis using machine learning. papers that focus on traditional energy system analysis without machine learning approaches or research that focuses on machine learning without an application to energy system analysis are not relevant."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "47", "default_text": "Artificial Intelligence in Farming", "description": "Which publications explore the use of Artificial Intelligence infarming?", "narrative": "Relevant publications investigate how Artificial Intelligence (AI) technologies are being applied to enhance various aspects of farming. This includes optimizing crop management, improving livestock health and production, and increasing overall agricultural efficiency. These studies delve into the utilization of AI in precision agriculture, predictive analytics for weather and pest control, and the development of smart farming systems. The goal is to find innovative ways to increase crop yields, reduce resource wastage, and make farming more sustainable and productive."}
{"dataset": "ir-lab-jena-leipzig-wise-2023/leipzig-topics-20231025-test", "qid": "48", "default_text": "Explainable AI (XAI) in Cyber Security", "description": "What publications explore the use of Explainable AI (XAI) to improve the detection and prevention of cyber attacks?", "narrative": "Relevant papers include research on new approaches to cyber security using Explainable AI (XAI). Papers that focus on traditional cyber security without XAI approaches or research that focuses on XAI without an application to cyber security are not relevant."}
